
//f(n)函数的定义为0~n中包含的1的个数

//f(13)是0~13中包含1的有 1，10，11，12，13，所以f(13)=6

//f(1) = 1。

//求另一个f(n)=n的n值


#include<stdio.h>
int main()
{
	int n=2,m=1;
	while(1)
	{
		n++;
		int x=n;
		while(x)
		{
			if(x%10==1)
			m++;
			x/=10;                  //“/=”属于复合赋值运算符中的一种，表示把左边的变量除于右边变量的值赋予右边的变量，
			                        //例如：a/=b等价于a=a/b。同类的还有*=（例如：a*=b等价于a=a*b）、+=(例如：a+=b等价于a=a+b)、
									//-=（例如：a-=b等价于a=a-b）、
									//%=（例如：a%=b等价于a=a%b（这里的%符号是求余运算符，a%b表示求a除于b的余数））。
	                         		//或许你还会问为什么a/=b为什么不直接用a=a/b来表示，这是因为这样的表示方法可以让程序更加简洁。 
		}
		if(m==n)
		{
			printf("%d",n);
			break;
		}
	}
  return 0;
}

                    
    
     
        
    

